; domain
;; Transport sequential
;;

(define (domain transport)
  (:requirements :typing :action-costs)
  (:types
        location target locatable - object
        vehicle package - locatable
        capacity-number - object
  )

  (:predicates 
     (road ?l1 ?l2 - location)
     (at ?x - locatable ?v - location)
     (in ?x - package ?v - vehicle)
     (capacity ?v - vehicle ?s1 - capacity-number)
     (capacity-predecessor ?s1 ?s2 - capacity-number)
  )

  (:functions
     (road-length ?l1 ?l2 - location) - number
     (total-cost) - number
  )

  (:action drive
    :parameters (?v - vehicle ?l1 ?l2 - location)
    :precondition (and
        (at ?v ?l1)
        (road ?l1 ?l2)
      )
    :effect (and
        (not (at ?v ?l1))
        (at ?v ?l2)
        (increase (total-cost) (road-length ?l1 ?l2))
      )
  )

 (:action pick-up
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (at ?p ?l)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s2)
      )
    :effect (and
        (not (at ?p ?l))
        (in ?p ?v)
        (capacity ?v ?s1)
        (not (capacity ?v ?s2))
        (increase (total-cost) 1)
      )
  )

  (:action drop
    :parameters (?v - vehicle ?l - location ?p - package ?s1 ?s2 - capacity-number)
    :precondition (and
        (at ?v ?l)
        (in ?p ?v)
        (capacity-predecessor ?s1 ?s2)
        (capacity ?v ?s1)
      )
    :effect (and
        (not (in ?p ?v))
        (at ?p ?l)
        (capacity ?v ?s2)
        (not (capacity ?v ?s1))
        (increase (total-cost) 1)
      )
  )

)

; problem
; Transport two-cities-sequential-5nodes-1000size-4degree-100mindistance-2trucks-2packages-131seed

(define (problem transport-two-cities-sequential-5nodes-1000size-4degree-100mindistance-2trucks-2packages-131seed)
 (:domain transport)
 (:objects
  city-1-loc-1 - location
  city-2-loc-1 - location
  city-1-loc-2 - location
  city-2-loc-2 - location
  city-1-loc-3 - location
  city-2-loc-3 - location
  city-1-loc-4 - location
  city-2-loc-4 - location
  city-1-loc-5 - location
  city-2-loc-5 - location
  truck-1 - vehicle
  truck-2 - vehicle
  package-1 - package
  package-2 - package
  capacity-0 - capacity-number
  capacity-1 - capacity-number
  capacity-2 - capacity-number
  capacity-3 - capacity-number
  capacity-4 - capacity-number
 )
 (:init
  (= (total-cost) 0)
  (capacity-predecessor capacity-0 capacity-1)
  (capacity-predecessor capacity-1 capacity-2)
  (capacity-predecessor capacity-2 capacity-3)
  (capacity-predecessor capacity-3 capacity-4)
  ; 788,520 -> 323,381
  (road city-1-loc-2 city-1-loc-1)
  (= (road-length city-1-loc-2 city-1-loc-1) 49)
  ; 323,381 -> 788,520
  (road city-1-loc-1 city-1-loc-2)
  (= (road-length city-1-loc-1 city-1-loc-2) 49)
  ; 89,402 -> 323,381
  (road city-1-loc-3 city-1-loc-1)
  (= (road-length city-1-loc-3 city-1-loc-1) 24)
  ; 323,381 -> 89,402
  (road city-1-loc-1 city-1-loc-3)
  (= (road-length city-1-loc-1 city-1-loc-3) 24)
  ; 293,17 -> 323,381
  (road city-1-loc-4 city-1-loc-1)
  (= (road-length city-1-loc-4 city-1-loc-1) 37)
  ; 323,381 -> 293,17
  (road city-1-loc-1 city-1-loc-4)
  (= (road-length city-1-loc-1 city-1-loc-4) 37)
  ; 293,17 -> 89,402
  (road city-1-loc-4 city-1-loc-3)
  (= (road-length city-1-loc-4 city-1-loc-3) 44)
  ; 89,402 -> 293,17
  (road city-1-loc-3 city-1-loc-4)
  (= (road-length city-1-loc-3 city-1-loc-4) 44)
  ; 399,797 -> 323,381
  (road city-1-loc-5 city-1-loc-1)
  (= (road-length city-1-loc-5 city-1-loc-1) 43)
  ; 323,381 -> 399,797
  (road city-1-loc-1 city-1-loc-5)
  (= (road-length city-1-loc-1 city-1-loc-5) 43)
  ; 399,797 -> 788,520
  (road city-1-loc-5 city-1-loc-2)
  (= (road-length city-1-loc-5 city-1-loc-2) 48)
  ; 788,520 -> 399,797
  (road city-1-loc-2 city-1-loc-5)
  (= (road-length city-1-loc-2 city-1-loc-5) 48)
  ; 399,797 -> 89,402
  (road city-1-loc-5 city-1-loc-3)
  (= (road-length city-1-loc-5 city-1-loc-3) 51)
  ; 89,402 -> 399,797
  (road city-1-loc-3 city-1-loc-5)
  (= (road-length city-1-loc-3 city-1-loc-5) 51)
  ; 2566,699 -> 2715,707
  (road city-2-loc-2 city-2-loc-1)
  (= (road-length city-2-loc-2 city-2-loc-1) 15)
  ; 2715,707 -> 2566,699
  (road city-2-loc-1 city-2-loc-2)
  (= (road-length city-2-loc-1 city-2-loc-2) 15)
  ; 2737,989 -> 2715,707
  (road city-2-loc-3 city-2-loc-1)
  (= (road-length city-2-loc-3 city-2-loc-1) 29)
  ; 2715,707 -> 2737,989
  (road city-2-loc-1 city-2-loc-3)
  (= (road-length city-2-loc-1 city-2-loc-3) 29)
  ; 2737,989 -> 2566,699
  (road city-2-loc-3 city-2-loc-2)
  (= (road-length city-2-loc-3 city-2-loc-2) 34)
  ; 2566,699 -> 2737,989
  (road city-2-loc-2 city-2-loc-3)
  (= (road-length city-2-loc-2 city-2-loc-3) 34)
  ; 2452,500 -> 2715,707
  (road city-2-loc-4 city-2-loc-1)
  (= (road-length city-2-loc-4 city-2-loc-1) 34)
  ; 2715,707 -> 2452,500
  (road city-2-loc-1 city-2-loc-4)
  (= (road-length city-2-loc-1 city-2-loc-4) 34)
  ; 2452,500 -> 2566,699
  (road city-2-loc-4 city-2-loc-2)
  (= (road-length city-2-loc-4 city-2-loc-2) 23)
  ; 2566,699 -> 2452,500
  (road city-2-loc-2 city-2-loc-4)
  (= (road-length city-2-loc-2 city-2-loc-4) 23)
  ; 2452,500 -> 2737,989
  (road city-2-loc-4 city-2-loc-3)
  (= (road-length city-2-loc-4 city-2-loc-3) 57)
  ; 2737,989 -> 2452,500
  (road city-2-loc-3 city-2-loc-4)
  (= (road-length city-2-loc-3 city-2-loc-4) 57)
  ; 2766,205 -> 2715,707
  (road city-2-loc-5 city-2-loc-1)
  (= (road-length city-2-loc-5 city-2-loc-1) 51)
  ; 2715,707 -> 2766,205
  (road city-2-loc-1 city-2-loc-5)
  (= (road-length city-2-loc-1 city-2-loc-5) 51)
  ; 2766,205 -> 2566,699
  (road city-2-loc-5 city-2-loc-2)
  (= (road-length city-2-loc-5 city-2-loc-2) 54)
  ; 2566,699 -> 2766,205
  (road city-2-loc-2 city-2-loc-5)
  (= (road-length city-2-loc-2 city-2-loc-5) 54)
  ; 2766,205 -> 2452,500
  (road city-2-loc-5 city-2-loc-4)
  (= (road-length city-2-loc-5 city-2-loc-4) 44)
  ; 2452,500 -> 2766,205
  (road city-2-loc-4 city-2-loc-5)
  (= (road-length city-2-loc-4 city-2-loc-5) 44)
  ; 788,520 <-> 2452,500
  (road city-1-loc-2 city-2-loc-4)
  (= (road-length city-1-loc-2 city-2-loc-4) 167)
  (road city-2-loc-4 city-1-loc-2)
  (= (road-length city-2-loc-4 city-1-loc-2) 167)
  (at package-1 city-1-loc-2)
  (at package-2 city-1-loc-5)
  (at truck-1 city-2-loc-1)
  (capacity truck-1 capacity-4)
  (at truck-2 city-2-loc-2)
  (capacity truck-2 capacity-3)
 )
 (:goal (and
  (at package-1 city-2-loc-5)
  (at package-2 city-2-loc-2)
 ))
 (:metric minimize (total-cost))
)

; plan
1. (drive truck-1 city-2-loc-1 city-2-loc-4)
   deleted: (at truck-1 city-2-loc-1)
   added: (at truck-1 city-2-loc-4)
   goals met: 0 of 2
2. (drive truck-1 city-2-loc-4 city-1-loc-2)
   deleted: (at truck-1 city-2-loc-4)
   added: (at truck-1 city-1-loc-2)
   goals met: 0 of 2
3. (pick-up truck-1 city-1-loc-2 package-1 capacity-3 capacity-4)
   deleted: (at package-1 city-1-loc-2) (capacity truck-1 capacity-4)
   added: (in package-1 truck-1) (capacity truck-1 capacity-3)
   goals met: 0 of 2
4. (drive truck-1 city-1-loc-2 city-1-loc-5)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-1-loc-5)
   goals met: 0 of 2
5. (pick-up truck-1 city-1-loc-5 package-2 capacity-2 capacity-3)
   deleted: (at package-2 city-1-loc-5) (capacity truck-1 capacity-3)
   added: (in package-2 truck-1) (capacity truck-1 capacity-2)
   goals met: 0 of 2
6. (drive truck-1 city-1-loc-5 city-1-loc-2)
   deleted: (at truck-1 city-1-loc-5)
   added: (at truck-1 city-1-loc-2)
   goals met: 0 of 2
7. (drive truck-1 city-1-loc-2 city-2-loc-4)
   deleted: (at truck-1 city-1-loc-2)
   added: (at truck-1 city-2-loc-4)
   goals met: 0 of 2
8. (drive truck-1 city-2-loc-4 city-2-loc-2)
   deleted: (at truck-1 city-2-loc-4)
   added: (at truck-1 city-2-loc-2)
   goals met: 0 of 2
9. (drop truck-1 city-2-loc-2 package-2 capacity-2 capacity-3)
   deleted: (in package-2 truck-1) (capacity truck-1 capacity-2)
   added: (at package-2 city-2-loc-2) (capacity truck-1 capacity-3)
   goals met: 1 of 2
10. (drive truck-1 city-2-loc-2 city-2-loc-5)
   deleted: (at truck-1 city-2-loc-2)
   added: (at truck-1 city-2-loc-5)
   goals met: 1 of 2
11. (drop truck-1 city-2-loc-5 package-1 capacity-3 capacity-4)
   deleted: (in package-1 truck-1) (capacity truck-1 capacity-3)
   added: (at package-1 city-2-loc-5) (capacity truck-1 capacity-4)
   goals met: 2 of 2
